/*
 * Масиви
 *
 * - Створення масиву
 * - Доступ до елементів
 * - Перевизначення значення елемента
 * - Довжина масиву
 * - Індекс останнього елемента
 */

//* структура даних - певний контейнер для зберігання якихось даних з певними правилами та методами для роботи  з цими даними і доступу до них

//* масив - це структура даних (зазвичай повинен зберігати дані одного типу) яка зберігає набір певних значень. Основним правилом зберігання є те, що у кожної одиниці цих даних повинен бути власний індекс (індексація починається з 0). Також масив надає певні методи для роботи з цими даними. Для доступу до конкретної комірки даних потрібно користуватися порядковим номером (індексом)

//* [] - створення нового масиву, тобто, виділяється нова комірка памʼяті, куди записується посилання на цей масив

const courses = ['HTML', 'CSS', 'JavaScript', 'React', 'PostgreSQL'];

console.log(courses);

// щоб отримати доступ до певної комірки в масиві - ми будемо звертатись до неї за індексом arr[index]

console.log('0:', courses[0]);
console.log('1:', courses[1]);
console.log('2:', courses[2]);
console.log('3:', courses[3]);
console.log('4:', courses[4]);
console.log('5:', courses[5]);

courses[0] = 'XML';

console.log(courses);

// можу отримати довжину масиву (кількість елементів в ньому) за допомогою властивості .length

console.log(courses.length);

// якщо нам потрібно отримати індекс останнього елементу масиву ми будемо віднімати 1 від довжини масиву (тому що розрахунок починається з 0)

const lastIndex = courses.length - 1;
console.log(lastIndex, courses[lastIndex]);
