/*
 * Масиви
 *
 * - Створення масиву
 * - Доступ до елементів
 * - Перевизначення значення елемента
 * - Довжина масиву
 * - Індекс останнього елемента
 */

//* структура даних - певний контейнер для зберігання якихось даних з певними правилами та методами для роботи  з цими даними і доступу до них

//* масив - це структура даних (зазвичай повинен зберігати дані одного типу) яка зберігає набір певних значень. Основним правилом зберігання є те, що у кожної одиниці цих даних повинен бути власний індекс (індексація починається з 0). Також масив надає певні методи для роботи з цими даними. Для доступу до конкретної комірки даних потрібно користуватися порядковим номером (індексом)

//* [] - створення нового масиву, тобто, виділяється нова комірка памʼяті, куди записується посилання на цей масив


const courses = ['HTML', 'CSS', 'JavaScript', 'React', 'PostgreSQL'];
