/*
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

// масиви - це складні дані (структури даних), на відміну від примітивів вони зберігаються не за значенням, а за посиланням на комірку памʼяті

/*
? Створіть змінну a = 10.
? Створіть та привласніть змінній b, значення змінної a.
? Виведіть до консолі обидві ці змінні.
? Змініть значення змінної a і ще раз виведіть у консоль.
*/


/*
? Створіть масив arr1 = [1, 2, 3].
? Створіть та привласніть змінній arr2, значення змінної arr1.
? Виведіть до консолі обидва цих масива.
? Додайте елемент в масив arr1 і ще раз виведете обидва масиви в консоль.
*/
