//! TASK 1

/*
? Напиши програму, яка приймає масив чисел і повертає новий масив, в якому кожен елемент буде сумою всіх попередніх чисел в оригінальному масиві. Наприклад, для масиву [1, 2, 3, 4] результат буде [1, 3, 6, 10].
*/

//! TASK 2

/*
? Створи функцію filterEvenNumbers(arr), яка приймає масив чисел і повертає новий масив, що містить лише парні числа з оригінального масиву.
*/

//! TASK 3

/*
? Напиши програму, яка обчислює та виводить суму всіх непарних чисел від 1 до n, де n — це число, введене користувачем.
*/

//! TASK 4

/*
? Напиши функцію findDuplicates(arr), яка приймає масив і повертає новий масив, що містить всі повторювані елементи з оригінального масиву. У новому масиві не повинно бути дублювань.
*/

//! TASK 5

/*
? Напиши програму, яка генерує та виводить таблицю множення (наприклад, для чисел від 1 до 10) у вигляді двовимірного масиву. Кожен рядок масиву повинен містити результати множення одного числа на всі інші числа.
*/
